xiefeimcu/mcu_code/stm32/HardwareLib/config.c
/*
 * config.c
 *
 *  Created on: 2017年8月16日
 *      Author: xiefei
 */
#include "usart.h"
#include "config.h"
#include "stm32f1xx_hal.h"
#include "AT24C04.h"

#define READ_NVM(SrcBuf,len,addr) Read_NByte_Randomaddress(SrcBuf,len,addr)
#define WRITE_NVM(addr,SrcBuf,len)

rtuParameter_t rtuParameter;

uint32_t convert_baudRate(uint8_t idx){

	switch(idx){

	case BAUD_2400:
		return 2400;

	case BAUD_4800:
		return 4800;

	case BAUD_9600:
		return 9600;

	case BAUD_14400:
		return 14400;

	case BAUD_19200:
		return 19200;

	case BAUD_57600:
		return 57600;

	case BAUD_115200:
		return 115200;

	default:break;
	}

	return 9600;
}

void upData_config(){
	/*
	 * 执行相关设置
	 */
	change_uart_baudrate(&RS2321_UART_HANDLE,
			convert_baudRate(rtuParameter.comBaudRate.baudRateRs2321));
	change_uart_baudrate(&RS2322_UART_HANDLE,
			convert_baudRate(rtuParameter.comBaudRate.baudRateRs2322));
	change_uart_baudrate(&RS4851_UART_HANDLE,
			convert_baudRate(rtuParameter.comBaudRate.baudRateRs4851));
	change_uart_baudrate(&RS4852_UART_HANDLE,
			convert_baudRate(rtuParameter.comBaudRate.baudRateRs4852));

	/*
	 * 写入EEPROM
	 */

/*reStartMcu?*/

}

void load_config_Default(void){
	rtuParameter.comBaudRate.baudRateRs2321=BAUD_9600;
	rtuParameter.comBaudRate.baudRateRs2322=BAUD_9600;
	rtuParameter.comBaudRate.baudRateRs4851=BAUD_9600;
	rtuParameter.comBaudRate.baudRateRs4852=BAUD_9600;
	rtuParameter.sysConfig.lcdCloseTime=55;
	rtuParameter.sysConfig.lcdcloseBkTime=35;
	rtuParameter.sysConfig.mcuStopTime=60;
	rtuParameter.upDataArg.RtuStationAddr[0]=1;
	rtuParameter.upDataArg.RtuStationAddr[1]=1;
	rtuParameter.upDataArg.RtuStationAddr[2]=1;
	rtuParameter.upDataArg.RtuStationAddr[3]=1;
	rtuParameter.upDataArg.RtuStationAddr[4]=1;
	rtuParameter.upDataArg.centreStationAddr=0x01;
	rtuParameter.upDataArg.passWord = 1234;
	rtuParameter.upDataArg.rtuType = RTU_TYPE_SK; //水库
	rtuParameter.upDataArg.timeAverageInterval=5; //5分钟


	 /*雨量计分频系数*/
	rtuParameter.rainGaugeParamater.rainGaugePsc=2;

	upData_config();
}
/*
 *return 0 success
 *return -1 fail
 */
int8_t load_config(void){
	if (READ_NVM((uint8_t*)(&rtuParameter),sizeof(rtuParameter),0x02))
		return 0;
	else
		return -1;
}




